app/views/beers/show.html.erb

SELECT "notes".* FROM "notes" WHERE "notes"."beer_id" = ?  [["beer_id", 1]]
---
  <tbody>
    <% @beer.notes.each do |note| %>